//
//  StaticArray.swift
//  Stacktest-ios
//
//  Created by СОВА on 25.06.2022.
//

import Foundation


class StaticArray {
    static var shared = StaticArray()
    let arrayStaticGroup11 = [
        ModelCategory(id: "16", name: "dorozhnye-znaki-rossii", alias: "dorozhnye-znaki-rossii", image: "images/categories/russ_zna.png", parentId: "1", title: "Дорожные знаки России", version: "1", test: [], stackTest: [], modelCategory: [
            ModelCategory(id: "19", name: "preduprezhdayushchie-znaki", alias: "preduprezhdayushchie-znaki", image: "images/categories/pred_1.png", parentId: "16", title: "Предупреждающие знаки", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "22", name: "znaki-prioriteta", alias: "znaki-prioriteta", image: "", parentId: "16", title: "Знаки приоритета", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "25", name: "zapreshchayushchie-znaki", alias: "zapreshchayushchie-znaki", image: "", parentId: "16", title: "Запрещающие знаки", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "28", name: "predrisyvayushchie-znaki", alias: "predrisyvayushchie-znaki", image: "", parentId: "16", title: "Предписывающие знаки", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "32", name: "znaki-osobykh-predpisanij", alias: "znaki-osobykh-predpisanij", image: "", parentId: "16", title: "Знаки особых предписаний", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "34", name: "informatsionnye-znaki", alias: "informatsionnye-znaki", image: "", parentId: "16", title: "Информационные знаки", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "36", name: "znaki-servisa", alias: "znaki-servisa", image: "", parentId: "16", title: "Знаки сервиса", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "39", name: "znaki-dopolnitelnoj-informatsii", alias: "znaki-dopolnitelnoj-informatsii", image: "", parentId: "16", title: "Знаки дополнительной информации", version: "1", test: [], stackTest: [], modelCategory: []),
            ModelCategory(id: "46", name: "gorizontalnaya-razmetka", alias: "gorizontalnaya-razmetka", image: "", parentId: "16", title: "Горизонтальная разметка", version: "1", test: [], stackTest: [
                
            ], modelCategory: []),
            ModelCategory(id: "47", name: "vertikalnaya-razmetka", alias: "vertikalnaya-razmetka", image: "", parentId: "16", title: "Вертикальная разметка", version: "1", test: [], stackTest: [], modelCategory: [])
        ]),
        ModelCategory(id: "42", name: "pdd-testy-rossii-gibdd", alias: "pdd-testy-rossii-gibdd", image: "images/categories/russ_test.png", parentId: "1", title: "ПДД тесты России (ГИБДД)", version: "1", test: [], stackTest: [], modelCategory: [
            ModelCategory(id: "8", name: "testy-pdd-kategoriya-a-b-m-rf-gibdd", alias: "testy-pdd-kategoriya-a-b-m-rf-gibdd", image: "images/categories/AB.png", parentId: "42", title: "Тесты ПДД категория \'A\'\'B\'\'M\'", version: "1", test: [
                ModelTest(
                    id: "1",
                    name: "test1-rf-pdd",
                    title: "1",
                    category: "8",
                    question: [
                        "В каком случае водитель совершит вынужденную остановку?",
                        "Разрешен ли Вам съезд на дорогу с грунтовым покрытием?",
                        "Можно ли Вам остановиться в указанном месте для посадки пассажира?",
                        "Какие из указанных знаков запрещают движение водителям мопедов?",
                        "Вы намерены повернуть налево. Где следует остановиться, чтобы уступить дорогу легковому автомобилю?",
                        "Что означает мигание зеленого сигнала светофора?",
                        "Водитель обязан подавать сигналы световыми указателями поворота (рукой):",
                        "Как Вам следует поступить при повороте направо?",
                        "По какой траектории Вам разрешено выполнить разворот?",
                        "С какой скоростью Вы можете продолжить движение вне населенного пункта по левой полосе на легковом автомобиле?",
                        "Можно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?",
                        "В каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?",
                        "При повороте направо Вы должны уступить дорогу:",
                        "Вы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?",
                        "Кому Вы обязаны уступить дорогу при повороте налево?",
                        "С какой максимальной скоростью можно продолжить движение за знаком?",
                        "Для перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:",
                        "При какой неисправности разрешается эксплуатация транспортного средства?",
                        "В случае, когда правые колеса автомобиля наезжают на неукрепленную влажную обочину, рекомендуется:",
                        "Что понимается под временем реакции водителя?"
                    ],
                    answer1: [
                        "Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу.",
                        "Разрешен.",
                        "Можно.",
                        "Только А",
                        "Перед знаком",
                        "Предупреждает о неисправности светофора.",
                        "Перед началом движения или перестроением.",
                        "Перестроиться на правую полосу, затем осуществить поворот.",
                        "Только по А.",
                        "Не более 50 км/ч.",
                        "Можно.",
                        "Только если расстояние до сплошной линии разметки не менее 3 м.",
                        "Только велосипедисту.",
                        "Обоим трамваям.",
                        "Только автобусу.",
                        "60 км/ч.",
                        "Категории «A» или подкатегории «A1».",
                        "Не работают пробки топливных баков.",
                        "Затормозить и полностью остановиться.",
                        "Время с момента обнаружения водителем опасности до полной остановки транспортного средства."
                    ],
                    answer2: [
                        "Остановившись на проезжей части из-за технической неисправности транспортного средства.",
                        "Разрешен только при технической неисправности транспортного средства.",
                        "Можно, если Вы управляете такси.",
                        "Только Б",
                        "Перед перекрестком у линии разметки.",
                        "Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал.",
                        "Перед поворотом или разворотом.",
                        "Продолжить движение по второй полосе до перекрестка, затем повернуть.",
                        "Только по Б.",
                        "Не менее 50 км/ч и не более 70 км/ч.",
                        "Можно, если скорость грузовых автомобилей менее 30 км/ч.",
                        "Только если расстояние до края пересекаемой проезжей части не менее 5 м.",
                        "Только пешеходам.",
                        "Только трамваю А.",
                        "Только легковому автомобилю.",
                        "50 км/ч.",
                        "Любой категории или подкатегории в течение двух и более лет.",
                        "Не работает механизм регулировки положения сиденья водителя.",
                        "Затормозить и плавно направить автомобиль на проезжую часть.",
                        "Время с момента обнаружения водителем опасности до начала принятия мер по ее избежанию."
                    ],
                    answer3: [
                        "В обоих перечисленных случаях.",
                        "Запрещен.",
                        "Нельзя.",
                        "В и Г",
                        "На перекрестке перед прерывистой линией разметки.",
                        "Запрещает дальнейшее движение.",
                        "Перед остановкой.",
                        "Возможны оба варианта действий.",
                        "По любой из указанных.",
                        "Не менее 50 км/ч и не более 90 км/ч.",
                        "Нельзя.",
                        "При соблюдении обоих перечисленных условий.",
                        "Пешеходам и велосипедисту.",
                        "Только трамваю Б.",
                        "Никому.",
                        "30 км/ч.",
                        "Только категории «A» или подкатегории «A1» в течение двух и более лет.",
                        "Не работают устройства обогрева и обдува стекол.",
                        "Не прибегая к торможению, плавно направить автомобиль на проезжую часть.",
                        "Время, необходимое для переноса ноги с педали управления подачей топлива на педаль тормоза."
                    ],
                    answer4: [
                        "",
                        "",
                        "",
                        "Все",
                        "В любом месте по усмотрению водителя.",
                        "",
                        "Во всех перечисленных случаях.",
                        "",
                        "",
                        "",
                        "",
                        "",
                        "Никому.",
                        "Никому.",
                        "",
                        "20 км/ч.",
                        "",
                        "Не работает стеклоподъемник.",
                        "",
                        ""],
                    correct: [
                        "2", "1", "1", "4", "2", "2", "4", "3", "1", "3", "1", "3", "3", "1", "3", "4", "3", "4", "3", "2"
                    ],
                    img: [
                        "",
                        "images/test_russia/b1-2/3f9a639.jpg",
                        "images/test_russia/b1-2/8fd84f3b81.jpg",
                        "images/test_russia/b1-2/SZKoDrt.jpg",
                        "images/test_russia/b1-2/KrqeLVl.jpg",
                        "",
                        "",
                        "images/test_russia/b1-2/7jTeBxf.jpg",
                        "images/test_russia/b1-2/GiPiUHh.jpg",
                        "images/test_russia/b1-2/dREbJrq.jpg",
                        "images/test_russia/b1-2/tGbyt45.jpg",
                        "images/test_russia/b1-2/YFRXvgQ.jpg",
                        "images/test_russia/b1-2/40ae.jpg",
                        "images/test_russia/b1-2/56b7d60779d5a12.jpg",
                        "images/test_russia/b1-2/SvP2rYy.jpg",
                        "images/test_russia/b1-2/i7fIAsg.jpg",
                        "",
                        "",
                        "",
                        ""
                    ])
            ], stackTest: [], modelCategory: []),
            ModelCategory(id: "43", name: "testy-pdd-kategoriya-c-d", alias: "testy-pdd-kategoriya-c-d", image: "images/categories/CD.png", parentId: "42", title: "Тесты ПДД категория \'C\'\'D\'", version: "1", test: [], stackTest: [], modelCategory: [])])
    ]
    let obuchenieArrayStatik = [
        ModelCategory(id: "54", name: "obuchenie", alias: "obuchenie", image: "images/categories/stack_vosk.png", parentId: "1", title: "Учебные карточки", version: "1", test: [], stackTest: [], modelCategory: [])
    ]
    let questionStatic = ModelQuestion(title: "9", question: "Водитель движущегося автомобиля перед перестроением включил указатель поворота. Должен ли он уступить дорогу транспортным средствам, на полосу которых он собрался перестраиваться?", answer1: " Да, можно.", answer2: "Да, можно, но в определенных пропорциях.", answer3: "Нет, нельзя.", answer4: "", correct: "3", img: "images/test_ukr_b/b15-16/1.jpg")
    let exsameStatic = [
        ModelQuestion(title: "8", question: "При управлении автобусом, участвующим в международном движении, общая продолжительность рабочего времени водителя автобуса в течение двух недель подряд регистрируется тахографом. Согласно нормативным документам она не должна превышать:", answer1: "56 часов.", answer2: "56 часов.", answer3: "49 часов.", answer4: "90 часов.", correct: "4", img: ""),
        ModelQuestion(title: "55", question: "В каком направлении разрешено двигаться организованным группам людей по проезжей части?", answer1: "Только навстречу движению, друг за другом.", answer2: "В любую удобную сторону, в зависимости от интенсивности движения, колонной по четыре человека в ряду.", answer3: "Только в направлении движения транспортных средств колонной не более чем по четыре человека в ряду.", answer4: "", correct: "3", img: ""),
        ModelQuestion(title: "10", question: "Какие правила обязан соблюдать водитель троллейбуса?", answer1: "Правила дорожного движения.", answer2: "Правила перевозки опасных грузов.", answer3: "Правила технической эксплуатации троллейбуса.", answer4: "Ответы 1 и 3.", correct: "4", img: ""),
        ModelQuestion(title: "43", question: "Какой из водителей правильно занял полосу перед остановкой?", answer1: "Водитель, находящийся справа.", answer2: "Водитель, находящийся слева.", answer3: "Оба водителя.", answer4: "", correct: "", img: "images/test_ukr_b/b19-20/1.jpg"),
        ModelQuestion(title: "17", question: "Перевозка пассажиров запрещена:", answer1: "В кузове автомобиля-самосвала.", answer2: "В кузове трактора и других самоходных машин.", answer3: "В кузове трактора и других самоходных машин.", answer4: "Все вышеперечисленное.", correct: "4", img: ""),
        ModelQuestion(title: "45", question: "Как должно двигаться транспортное средство, скорость движения которого не должна превышать 40 км/ч или которое по техническим причинам не может развивать такую скорость?", answer1: "Должно двигаться как можно ближе к правому краю проезжей части, кроме случаев, когда выполняется объезд или обгон.", answer2: "Должно двигаться как можно ближе к правому краю проезжей части, кроме случаев, когда выполняется перестроение перед поворотом налево или разворотом.", answer3: "Может двигаться в любой полосе.", answer4: "Ответы 1 и 2.", correct: "4", img: ""),
        ModelQuestion(title: "43", question: "Какой из водителей правильно занял полосу перед остановкой?", answer1: "Водитель, находящийся справа.", answer2: "Водитель, находящийся слева.", answer3: "Оба водителя.", answer4: "", correct: "", img: "images/test_ukr_b/b19-20/1.jpg"),
        ModelQuestion(title: "32", question: "На каком светофоре горит сигнал, разрешающий трамваю повернуть направо?", answer1: "На третьем и четвертом.", answer2: "Только на четвертом.", answer3: "На втором светофоре.", answer4: "На втором и четвертом.", correct: "3", img: "images/test_ukr_b/b7-8/n.jpg"),
        ModelQuestion(title: "13", question: "Разрешено ли смешивать охлаждающие жидкости разных цветов?", answer1: "Разрешено, только в пропорции 1/2.", answer2: "Разрешено, только в пропорции 1/4", answer3: "Запрещено.", answer4: "", correct: "3", img: ""),
        ModelQuestion(title: "52", question: "Разрешено ли водителю желтого автомобиля выехать на полосу встречного движения?", answer1: "Разрешено для выполнения обгона, в случае если транспортное средство движется со скоростью менее 30 км/ч.", answer2: "Запрещено.", answer3: "", answer4: "", correct: "2", img: "images/test_ukr_b/b27-28/91.jpg"),
        ModelQuestion(title: "44", question: "Дорожными работами считаются:", answer1: "Работы, связанные с инженерным обустройством, установкой (ремонтом, заменой) технических средств организации дорожного движения.", answer2: "Работы, связанные со строительством, реконструкцией, ремонтом или содержанием автомобильной дороги (улицы), искусственных сооружений, сооружений дорожного водоотвода.", answer3: "Ответы, указанные в пунктах 1, 2.", answer4: "", correct: "3", img: "images/test_ukr_b/b19-20/94.jpg"),
        ModelQuestion(title: "7", question: "Разрешено ли водителю грузового автомобиля выполнить обгон в представленной ситуации, если обгоняемый состав движется со скоростью менее 30 км/ч?", answer1: "Разрешено.", answer2: "Запрещено.", answer3: "", answer4: "", correct: "1", img: "images/test_ukr_acde/acde5-10/91.jpg"),
        ModelQuestion(title: "3", question: "Как должен поступить водитель автобуса, если в результате дорожно-транспортного происшествия двери автобуса оказались заблокированными?", answer1: "Сообщить о случившемся и дождаться прибытия технической помощи.", answer2: "Попросить, чтобы пассажиры, сохраняя порядок и спокойствие, покинули автобус через аварийные выходы в окнах и на крыше.", answer3: "При содействии пассажиров, которые не пострадали, помочь раненным, лицам с инвалидностью и детям безопасно покинуть автобус.", answer4: "Выполнить действия, перечисленные в пунктах 2 и 3.", correct: "4", img: ""),
        ModelQuestion(title: "49", question: "Должен ли водитель автомобиля, двигаясь по главной дороге, уступить дорогу транспортному средству с включённым синим проблесковым маячком?", answer1: "Не должен.", answer2: "Должен.", answer3: "", answer4: "", correct: "2", img: "images/test_ukr_b/b25-26/1.jpg"),
        ModelQuestion(title: "47", question: "Разрешено ли движение через железнодорожный переезд в ситуации изображенной на рисунке?", answer1: "Разрешено.", answer2: "Запрещено.", answer3: "", answer4: "", correct: "2", img: "images/test_ukr_b/b23-24/1.jpg"),
        ModelQuestion(title: "18", question: "На своем пути вы видите большую выбоину в асфальте. Ваша реакция:", answer1: "Постараться объехать выбоину.", answer2: "Постараться увернуться, если не получается, заехать в выбоину по наиболее прямой траектории.", answer3: "Уменьшить скорость до выбоины, встать на подножки и немного отклониться назад, чтобы разгрузить переднюю вилку мотоцикла в момент въезда в выбоину.", answer4: "Ответы 2 и 3 в зависимости от обстоятельств.", correct: "4", img: ""),
        ModelQuestion(title: "21", question: "Максимальное количество детей для перевозки автобусом не должно превышать:", answer1: "Количества мест для сидения, определенного технической характеристикой и регистрационными документами транспортного средства.", answer2: "Количества мест для сидения и стояния, определенного технической характеристикой и регистрационными документами транспортного средства.", answer3: "", answer4: "", correct: "1", img: ""),
        ModelQuestion(title: "43", question: "Какой из водителей правильно занял полосу перед остановкой?", answer1: "Водитель, находящийся справа.", answer2: "Водитель, находящийся слева.", answer3: "Оба водителя.", answer4: "", correct: "", img: "images/test_ukr_b/b19-20/1.jpg"),
        ModelQuestion(title: "55", question: "В каком направлении разрешено двигаться организованным группам людей по проезжей части?", answer1: "Только навстречу движению, друг за другом.", answer2: "В любую удобную сторону, в зависимости от интенсивности движения, колонной по четыре человека в ряду.", answer3: "Только в направлении движения транспортных средств колонной не более чем по четыре человека в ряду.", answer4: "", correct: "3", img: ""),
        ModelQuestion(title: "17", question: "Перевозка пассажиров запрещена:", answer1: "В кузове автомобиля-самосвала.", answer2: "В кузове трактора и других самоходных машин.", answer3: "В кузове трактора и других самоходных машин.", answer4: "Все вышеперечисленное.", correct: "4", img: "")]
}

